app/controllers/task_controller.rb

SELECT "users".* FROM "users" WHERE (activesess = 'g_5727345458207133') LIMIT 1
SELECT "tasks".* FROM "tasks" WHERE (uid = '1')
---
  def history
	@usr = UserController.findUser(session[:activesess])
	session[:activesess] = @usr.activesess
	@tasklist = Task.where("uid = ?", @usr.id.to_s)

SELECT "users".* FROM "users" WHERE (activesess = 'g_5727345458207133') LIMIT 1
INSERT INTO "tasks" ("alignment_sequence", "base_sequence1", "base_sequence2", "created_at", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
	  @usr = UserController.findUser(session[:activesess])
	  session[:activesess] = @usr.activesess
	  s1,s2=params[:seq1],params[:seq2]
	  if !s1.nil? && s1!="" && !s2.nil? && s2!=""
	  	@tsk = Task.new
		@tsk.uid = @usr.id.to_s
	  	@tsk.base_sequence1 = s1
	  	@tsk.base_sequence2 = s2
	  	@tsk.alignment_sequence = needW(s1,s2)
	  	@tsk.save